app/controllers/conditions_controller.rb

SELECT "conditions".* FROM "conditions"
---
  def index
    @conditions = Condition.all